{"title":"Brighter Shores","content":"Brighter Shores is an adventure developed by Fen Research and designed by Andrew Gower. Early access to it was opened on 6 November 2024 at 09:48. It is available for Windows and macOS. The game is, but players can access additional features and content by purchasing the Premium Pass.\n\nBrighter Shores features an ongoing story with hundreds of hours of gameplay. New content is released in the game in an episodic format. Players start their journey in Hopeport, as a member of the town guard.\n\nThe official minimum requirements to run the game for different platforms are the following.\n\n\n * OS: Windows 10/11\n * Processor: Intel i3 or AMD equivalent\n * Memory: 8 GB RAM\n * Graphics: DirectX 11 capable graphics with at least 2GB RAM\n * DirectX: Version 11\n * Network: Broadband Internet connection\n * Storage: 2 GB available space\n * Additional Notes: Internet connection required to play\n\n\n * OS: 10.13+\n * Processor: Apple Silicon or Intel\n * Memory: 8 GB RAM\n * Graphics: Metal capable graphics\n * Network: Broadband Internet connection\n * Storage: 2 GB available space\n * Additional Notes: Internet connection required to play\n\nThe game can be downloaded and installed through its Steam page.\n\nAfter launching the game, the player is taken to the title screen.\n\nThe game has been under development since September 2016, but some assets were taken from Fen Research scrapped Chasm Game and was announced officially on 13 March 2024. An initial two-minute trailer was released, which depicts player characters engaging in combat, several professions, and a variety of different locations.\n\nPart of the reason that Brighter Shores took a long time to develop is because Gower decided to create a new game engine from scratch, as opposed to using a popular engine like or. He had previously created his own engine for his previous MMORPG in the early 2000s, programmed in. The engine that Gower built is called Fenforge, and had previously been used by at least two games prior to being used for Brighter Shores. Gower has said that active development on Brighter Shores officially started in 2017.\n\nInternal alpha tests with the first two episodes occurred in March 2024. The third episode was added to the alpha test in June 2024. Participants mostly consisted of staff, with a total of 12 people having Steam keys to access it.\n\nA closed beta test occurred between the alpha test and the early access launch.\n\nEarly access to the game was opened on 6 November 2024, with the game still missing many key features such as player-versus-player combat, special attacks for epic weapons, and the fifth episode, Stonemaw Hill. Early access is planned to \"maybe\" last for 6 months. There won't be a save reset or price increases to Premium Pass at the end of the early access.\n\n\n\n\n * The logo of Brighter Shores features Hopeport Obelisk.\n * Fen Research might have first wanted Brighter Shores to be named \"Wondrous Shores\", judging by the trademark filings on 11 January 2024 and 15 January 2024.\n * The game's early access launch was intended to be 5 November 2024, but was delayed by one day due to the.\n\n\n\n\n * Steam page\n * Official website","tables":[],"url":"https://brightershoreswiki.org/w/Brighter_Shores","last_modified":"2024-11-10T04:25:42Z","categories":["Category:Fen Research","Category:Games","Category:Pages with update history","Category:References that need verification"]}