{"title":"Experience","content":"Killing monsters and fulfilling certain tasks will grant players experience (also known as xp, exp) which they can accumulate to increase their levels in professions. Players will start a profession with zero experience, and are able to level their professions to level 500.\n\nThe following table shows the relationship between the profession level, the experience required for that level, and the experience difference from the previous level:\n\nThe following figures show the required experience per level and cumulative experience:\n\n\n\nSince the experience scales quite significantly, here the figures are repeated with a logarithmic exp-axis:\n\n\n\nBased on the above table, we can notice a few breakpoints in the experience formula:\n\nNovice:\n\nLevels 0-6 : every level requires around 2,95% more experience than the previous one;\n\nLevels 7-12: every level still requires 2,95% more experience, but the required experience is also doubled;\n\nLevels 13-20: again, every level requires 2,95% more experience, but it is once again doubled.\n\nFor example, going from level 13 to level 14 requires slightly more than 4x the experience required from level 4 to level 5.\n\nApprentice to expert:\n\nLevels 21-200: the required experience, per level, has been quintupled (explaining why you suddenly feel like you hit a wall once you are at skill level 20), and every new level from 21 to 200 requires 1,94% more experience than the previous one.\n\nExpert to ultimate:\n\nLevels 201-500: the required experience per level is once again quadrupled, then every new level requires around 0,60% more experience than the previous one.\n\nConclusions:\n\nSince the experience gain per action grows at a similar rate than experience needed (the percentage increase), but with no breakpoints, one can assume that the amount of actions required to level up from, let's say, 21 to 22, is the same than the one required from 198 to 199.\n\nLevels 0-20 are certainly made easier for the sake of allowing players to explore new professions quickly.\n\nLevels 21-200 look like the intended regular levels, requiring some dedication.\n\nFinally, levels 201+ require an absurd amount of experience and are likely here to make sure players end up specializing in something if they want to pursue leaderboards and the ultimate cape.\n\nImpact of knowledge conversion into experience:\n\nLevels 20-200: converting one knowledge point into experience grants 25% of a level.\n\nLevels 201-500: it grants 6,25% of a level. This is logical: since levels 200+ take four times more actions, having knowledge granting 25% of a level would mean post 200 leveling would rely mostly on knowledge conversion, which would feel weird for sure.","tables":[],"url":"https://brightershoreswiki.org/w/Experience","last_modified":"2024-11-11T13:41:08Z","categories":[]}