{"title":"Find Captain Waltain","content":"\n\n\n\nThe quest Find Captain Waltain is a continuation of the Main Story, and is the first quest to take place in Crenopolis.\n\n\n * Access to Crenopolis\n * US$36000 to purchase handcuffs\n\n\n * Talk to Captain Waltain in his office in Crenopolis.\n * In the Guardhouse Lobby (east), purchase a pair of handcuffs from the desk sergeant for US$36000.\n * Head to the Waterfront and talk to Sergeant Fowler.\n * After the cutscene, click on the Customer and select Apprehend.\n * Continue catching thieves until Captain Waltain arrives.\n * Head to the Goose Inn Bar and speak to Rachella\n * Choose \"I'm looking for a red robed sorcerer\"\n * Then select \"Anything I can do to change your mind?\"\n * This will advance the story to Help Rachella.\n\nHead to Crenopolis with the Letter from Captain Jal Degreene and speak to Captain Waltain in his office. Show him the letter, and he'll task you with helping the local guard while they search for information about the red-robed sorcerer.\n\nCaptain Waltain will assign you to work with Sergeant Fowler at the Waterfront to deal with a thief problem. Before heading to the market:\n * Visit the desk sergeant in the next room\n * Purchase a pair of handcuffs for US$36000\n * Head to the Waterfront southeast of Waltain's office\n\nAt the market, Sergeant Fowler will teach you how to catch thieves:\n * Watch a demonstration where you'll learn to identify suspicious behavior\n * Click on the Customer and select Apprehend to catch your first thief\n * Continue catching thieves until Captain Waltain arrives with news\n\nCaptain Waltain will inform you that the red-robed sorcerer was spotted at the Goose Inn Bar. Head there and speak to Rachella:\n * Choose \"I'm looking for a red robed sorcerer\"\n * When she hesitates to share information, select \"Anything I can do to change your mind?\"\n * She'll explain that she needs help getting into the merchants' guild\n\nThis will advance the story to Help Rachella.\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Find_Captain_Waltain","last_modified":"2024-11-10T22:41:55Z","categories":["Category:Crenopolis","Category:Needs image","Category:Quests"]}