{"title":"Forgotten Things","content":"\n\n\n\nThe quest Forgotten Things can be started by speaking to Marden in Timberwell Village.\n\n\n * Level 45 Woodcutter\n * Level 50 Carpenter\n * The ability to defeat a level 60 boss\n * A Rope\n * A Jar\n\n\n\n\n * I can start this quest by talking to Marden in Timberwell Village.\n * Talk to Yulo the Carpenter the Carpenter's Workshop, he will tell you he saw a blurred figure which caused him to crash his cart on the Mine Road West.\n * Head to the Mine Road West and you'll find some Footprints, investigate them.\n * Next you have to collect a sample of those footprints, for that you'll need a Jar, if you need one you can buy it from the near Timberwell Supplies shop.\n * Head to the Hopeforest Guard Shack and use the Soil Sample you collected on the Forensic Equipment.\n * You'll discover that the soil comes from the Peat Bog, in order to locate it inspect the Map of Hopeforest inside Tarana and Alden's Home.\n * Next head to the Road to Nowhere Much which is located in the northernmost point of the forest\n * After reaching the Road to Nowhere Much you'll find out that it's impossible to enter it. Talk to Shoggy who is blocking the other path loading north from Treeway Clearing.\n * Go back to the Hopeforest Guard Shack and speak to Broxoter, he'll give you the Clifftop Pass.\n * Return to Shoggy and show him the Pass.\n * Reach the Wooded Clifftop, and climb down the Protruding Rock (you'll need a Rope for that). (Kill a Rotting Bramblelith to add to your album)\n * Try entering the North Peat Bog, you'll be kicked out by Scaramdar.\n * Speak with the Daynel in the Peat Bog and select the options.\n * \"You're cursed by a magic box?\"\n * \"It's protected by a bad sorcerer?\"\n * \"You can distract the sorcerer, while i shut the box?\"\n * Head back into the North Peat Bog and pick up the Wooden Splinter. (Avoid being seen by the sorcerer or you will be forced out of the area)\n * That isn't enough to close the box, it needs a new panel making.\n * Bring the Splinter to Yulo the Carpenter the Carpenter's Workshop, he'll need Witchwood to repair it.\n * A Witchwood Tree is located in the Snakes Clearing, to chop it you need to be at least a level 45 Woodcutter.\n * Bring the Witchwood Log to Yulo who will direct you to create the Witchwood Chest Panel using the Workbench.\n * Talk to Marden, who is next to the Timber Bank and select the option: Does this Witchwood chest panel look familiar?\n * Travel back to the North Peat Bog, taking the Wooded Clifftop route, and fix the Smashed Box with the Witchwood Chest Panel.\n * Be prepared to fight Scaramdar.\n * Once he has been defeated, close the chest and free Daynel and Potricks.\n * Return to Tarana and Alden's home in Timberwell Green.\n * Talk to Marden to finish the quest.\n\n\n * Hopeforest North Portal Stone\n * 52,300 Carpenter XP\n * 63,500 Scout XP\n * 47,500 Woodcutter XP\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Forgotten_Things","last_modified":"2024-11-13T03:19:58Z","categories":["Category:Hopeforest","Category:Needs image","Category:Pages with update history","Category:Quests","Category:Stubs"]}