{"title":"Game news/Per episode combat professions","content":"\n\nOne aspect of Brighter Shores' design which has resulted in a lot of discussion has been our decision to have a separate combat profession per episode, so I thought I should explain our reasoning for this, and our planned changes in response to player feedback.\n\nFirst, I would just like to reassure you that your hard work levelling up your professions is definitely NOT wiped, reset or made irrelevant when you go to a new episode!\n\nWhen you reach episode 2, Hopeforest, four new professions are introduced: Scout, Woodcutter, Gatherer, and Carpenter.\n\nYour existing episode 1 professions remain untouched and are still useful anytime you are in Hopeport. You will find that you still regularly go back to Hopeport and use and further progress those professions. However, whilst you are in Hopeforest you will predominantly be relying on your Hopeforest professions, which can feel a bit strange to start with.\n\nWe have designed Brighter Shores to be enjoyable both for players who want to play the game many hours a day AND for people who might only be able to a play a few minutes a day. This means that, in the future, some players will be a much higher level than others!\n\nHowever, when we introduce new episodes we want them to be fun for everyone. But if there was a single combat profession across the whole game, and the monsters in episode 5 started at level 100 for example, then all the players who play a lot would already be a way higher level than that. They would find it way too easy, skipping past a huge chunk of the start of the episode, and then find that they don't have much to do. Conversely, all of the players who only play a little would find it way too hard and wouldn't be able to take part in episode 5 at all!\n\nSome games try to solve this problem by having a level cap to stop people being too high. This cap is increased each update, and they then 'accelerate' all characters up to the level of the latest content to stop people being too low. But this means every update results in a huge amount of 'dead content', and accelerating new players undermines the achievements of existing players. It also means people spend a long time stuck at a level cap with no further levelling possible.\n\nOther games try to solve this problem by making the content in the game 'autoscale' based on a player's level rather than having a fixed level. But we don't like this as it means levelling up doesn't actually achieve anything or unlock any new content.\n\nTherefore, we have designed Brighter Shores in a different way. We have gone with what we call the 'breadth and depth' system. It is NOT intended that you first 'finish' episode 1, then go on to episode 2 and never go back to episode 1 ever again.\n\nInstead, it is relatively easy to progress to each new episode (breadth), but even when you have reached the latest episode you are nowhere near finished. Instead, you can at any time choose any of the episodes you have unlocked and continue to level up further in that episode (depth). Each episode also has harder 'side quests' for this purpose. These side quests are intended for the players who want to put in more hours, and give a further reason to keep levelling up your professions in earlier episodes. Over time, we plan to add even higher level side quests, so that your Hopeport guard level will keep being useful for a long time! The difficulty of a side quest is indicated by its number of stars.\n\nThe episodes are also heavily interlinked, so you will regularly find yourself going back and forth between them. For example: You might use your episode 3 combat to kill some monsters for potion reagents. You might then take these reagents back to episode 1 to make some potions, which you then use in episode 4. Once you reach episode 3, you can also start making your own weapons which you can 'tune' for use in ANY of episodes 1 to 4, further interlinking the back and forth between the episodes, and allowing you to rapidly gear up in episode 4.\n\nI should also mention that all of our testing has shown that, once you get used to it, unlocking a fresh combat profession once in a while actually becomes quite fun. The earliest levels of the professions are generally the most fun as you level up much more quickly, and it's all new and fresh. We want people to be able to get that 'new and fresh' feeling each time we launch a new episode, rather than only getting it when they first start playing the game and never ever again! The first time you enter each episode you will probably start by 'gearing up' and getting a full set of armor and weapons, which is more rapidly rewarding than the incremental improvements once you have a full set of rare/epic gear.\n\nIf you still don't like the idea of multiple combat professions, you can of course always pick an episode you like and predominantly stick to doing combat in that one episode. When we add leaderboards, we expect that choosing a profession or episode to focus on to get to the top of that profession/episode's leaderboard will be a common strategy.\n\nBased on the feedback of those who find the reduced prominence of their Hopeport professions whilst in Hopeforest disconcerting, we are proposing to make a few changes:\n\n1) We have already made the first change! We have now changed the level shown next to your character name to be your TOTAL level across all profession in all episodes. This means that it doesn't disconcertingly jump back to a 0 whilst you are in Hopeforest, and better emphasizes that nothing has been reset and that all of your earlier progress is still relevant.\n\n2) We saw a player suggestion that we could add some special content that relies on MULTIPLE combat levels to complete. For example, a boss monster that you need to be both a high level guard AND a high level scout to defeat. We think that this is a great idea, and we will definitely be looking to add content of this nature in the future.\n\n3) We obviously need to better communicate our 'breadth and depth' system. Not only are people left thinking that once they move on to episode 2 their guard skill will be forever useless (it really won't!), but some people are also trying to complete ALL of the episode 1 side quests before even starting episode 2 and then finding it too grindy! This post is a first step towards solving this, but we also need to find a way to better communicate this in game! We are open to suggestions on this one!\n\n\n * One thing I plan on doing is showing the 'difficulty' rating on the main quest as well as the side quests, so you can see that carrying on with the main quest first is easier than doing the side quests.\n * Perhaps 'episode' isn't the clearest word to describe the different sections of the game? I could change it to 'area' or 'zone'?, but I'm not sure, as I liked emphasizing the episodic nature of the plot.\n\nHopefully this makes this things a lot clearer. Being able to add new episodes to the game that everyone can enjoy and without resulting in loads of 'dead content' is very important! We think our 'breadth and depth' design achieves this, but perhaps we didn't explain it very well!","tables":[],"url":"https://brightershoreswiki.org/w/Game_news/Per_episode_combat_professions","last_modified":"2024-11-09T04:48:00Z","categories":["Category:2024 updates"]}