{"title":"Game updates/2024-11-12","content":"No patch notes were published, but the build string was incremented to 0.4.1-de5c792519feda75.\n\n\n\nWe have updated the rules to make 'multiboxing' (logging in multiple accounts simultaneously) against the rules. This is no longer allowed, so if you have been doing it please stop now!\n\n\n * As requested by so many players... 'single click actions' are now a thing! If you wish to enable this then:\n * 1) open the settings.\n * 2) go the controls section and press 'open'.\n * 3) open the drop down next to 'do first action'.\n * 4) choose \"left click\".\n * This causes left clicking something in the 3d view to do the default action, and right clicking it still opens the full menu.\n\n\n * You can now also rotate the camera by dragging with the middle mouse button.\n * You can now reassign what each mouse button does (in settings->controls).\n * The active foraging block album cards now list which profession equipment is required to forage them. I realize this still needs adding in more places too.\n * If you have (unwisely!) deleted your entire account, you can now choose to create a new account.\n * The map now lets you click up to TWO rooms away.\n\n\n * If upgrading/enchanting your profession equipment results in you getting a fractional XP increase, (for example it results in say 124.5 XP) you will now get that fraction.\n * Make combat rooms a little less crowded. (1 less player allowed at once).\n * Make spear fishing rooms a lot less crowded, (max 10 players, instead of max 20 players).\n * Deplete spottable thieves (detective) upon login, so you cannot gain an advantage by server hopping.\n\n\n * Magnifying glass now boosts the XP of detective investigations again.\n * Fix bug which could cause a room to fail to render immediately after switching episode.\n * Fixes to animations when multiple people using T.E.A machine at once.\n * Fixes to animations when multiple people using B.R.E.W.S vat at once.\n * Fix safe spots in Guardian Spirit cave.\n * Fix safe spots on vipers.","tables":[],"url":"https://brightershoreswiki.org/w/Game_updates/2024-11-12","last_modified":"2024-11-12T14:56:20Z","categories":["Category:2024 updates"]}