{"title":"Game rules","content":"The game rules interface informs players about the rules that the players must follow.\n\nIt can be opened through the settings and chat agreement interfaces, and players must confirm to have read and agree to them through the agreement interface to continue with a player character creation.\n\n\n\nDon't misuse the chat. Hopefully this is common sense, but just in case here is a non-exhaustive list:\n\n\n * Nothing illegal.\n * Nothing offensive or toxic or threatening.\n * Nothing inflammatory (messages likely to make other players angry).\n * Nothing infringing 3rd party rights.\n * Nothing adult only.\n * No automated chat.\n * No swearing.\n * No harassment or bullying.\n * No advertising (except you CAN advertise in-game trades, i.e. trading in-game items/currency for other in-game items).\n * No scamming (deceiving other players for your own gain, or to maliciously harm them).\n * No sharing of personal information or passwords.\n * No asking others for personal information or passwords.\n * No spamming (posting nonsense, or the same thing over and over again).\n\n\n * No deliberate bug abuse.\n * No macroing (using 3rd party software to control/play the game automatically).\n * No real world trading (trading in-game items/currency for real world gain).\n * No using or creating 3rd-party Brighter Shores clients.\n * No using or creating a modified version of the Brighter Shores client.\n * No using or creating 3rd-party Brighter Shores servers.\n * No account sharing (more than one person using the same account, including lending the account to someone else to level up for you).\n * No logging in multiple accounts simultaneously (multiboxing).\n\n\n * No fraud.\n * No trying to reverse payments, except as described at https://www.brightershores.com/refunds.html\n * No account sharing (more than one person using the same account).\n\n\n * No unauthorized access of our servers or networks.\n * No reverse engineering or modifying our software.\n * No attacking our servers or networks (denial of service, etc...).\n * No trying to access other peoples' accounts.\n * No intercepting, modifying or impeding the communications between our client and our servers.\n * No other disruption or interference with our service.\n\nIf you break the rules then the penalty will depend on the nature and severity of the offense, but can include any combination of:\n\n\n * Your account or characters being suspended or permanently disabled.\n * Your privacy settings being locked at maximum (which will prevent various interactions with other players).\n * Your chat being suspended or permanently disabled.\n * Segregation from other players.\n * A daily playtime limit being imposed.\n * Access to the free version of the game being removed.\n * Disqualification from the leaderboards.\n * Trading with other players being disabled.\n * Disqualification from the PvP leagues.\n * Being required to rename your character.\n * Removal of in-game XP or items or currency, etc...\n * Real world consequences (police, lawyers, etc...).\n\nIf you feel a penalty has been issued in error you may appeal it in-game as follows:\n * 1) Open the settings interface.\n * 2) Click on the 'View Violations' button.\n * 3) Click on the row you wish to appeal.\n * 4) Click on the 'OPEN APPEAL' button, and fill in the form.\n\n\n\n\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Game_rules","last_modified":"2024-11-12T22:13:21Z","categories":["Category:Incomplete articles","Category:Interface","Category:Pages with update history"]}