{"title":"Game updates/2024-11-06","content":"We are currently rebooting the first bugfix update to Brighter Shores which hopefully fixes the following bugs: - players ocassionally getting stuck in combat. - ‘zombie’ error when attempting to login. - cant delete character with a very long name. - allow players from Cyprus and Taiwan. - screen can get stuck in a dimmed state and you can’t click. - some boss monsters broke if multiple players present. - sound wasnt working for some people. - a few minor typos.\n\n\n\n\n\nBrighter Shores is currently in 'early access'. This means a few core features aren't ready yet, and there are probably still some bugs! Please send any bug reports to bugs@fenresearch.com\n\nThere are some very important features we want to finish ASAP, and before we consider the game to no longer be in 'early access'. These include: - Player vs player combat (PvP). - Player to player trading. - Special attacks on epic weapons to make the different factions more distinct. - Episode 5 - Stonemaw Hill. - Leaderboards. - Additional (higher level) quests.\n\nThere will NOT be a save reset at the end of early access.\n\nI didn't originally plan to make another MMORPG, but so many people asked me to do so that I eventually gave in!\n\nWe are only a small indie team (we have never had more than 8 employees). I didn't want to involve external investors or publishers, as this is very much a 'passion project' for me. I made it purely because I love making games.\n\nMy team and I have poured years of hard work in to making this game, and I think we have managed to produce something which compares well with the products of much larger developers. I am incredibly proud of what we have created, so I really hope you enjoy it.\n\nI wasn't planning on doing an early access launch originally either, but I have been wanting to share what we are creating for years now, and it reached the point where I just couldn't stand waiting any longer! Hopefully there aren't too many rough edges. Expect it to improve rapidly over the coming months as we continue to work on it.","tables":[],"url":"https://brightershoreswiki.org/w/Game_updates/2024-11-06","last_modified":"2024-11-09T09:59:20Z","categories":["Category:2024 updates"]}