{"title":"Getting clearance from Waltain","content":"\n\n\n\nThe quest Getting clearance from Waltain is a continuation of the Main Story, commencing immediately after completing Head to Stonemaw Hill.\n\n\n * Completion of Head to Stonemaw Hill\n * Completion of Spider's Nest\n * Crenopolis level 60\n * Total level 342\n\n\n * Speak to Captain Waltain in Waltain's Office, selecting \"You wouldn’t be interfering. I would.\".\n * Head to Hopeport and speak with Captain Jal Degreene until he assigns Toblaine to you.\n * Head to the Barracks and speak with Toblaine until he leaves.\n * Speak to Captain Waltain again, which will advance the story to Retrieving the Golden Cog.\n\nSpeak to Captain Waltain in Waltain's Office about retrieving the Golden Cog from Helfar's compound. You explain that you need it to gain access to Stonemaw Hill where a red-robed sorcerer was headed.\n\nThe captain explains that while stealing is illegal, he cannot directly intervene due to Helfar's significant contributions to the Merchant's Guild. He fears losing his position if he interferes with Helfar's business.\n\nSuggest that you could handle the operation yourself, explaining that you would be acting as part of the Hopeport guard rather than the Crenopolis guard. The captain agrees this might work, but notes that since you've been seen doing Crenopolis guard work recently, you'll need support from the Hopeport guard to make this a legitimate Hopeport operation.\n\nHead to Hopeport and speak with Captain Jal Degreene about getting assistance. When you explain the situation with the Golden Cog and Helfar, he initially expresses reluctance due to being short-staffed. After explaining that Waltain can't help due to merchant guild politics and that you only need one guard to make it a legitimate Hopeport operation, the captain agrees to assign Toblaine to help you.\n\nHead to the Barracks to find Toblaine.\n\nWhen you first speak to him, you'll find he's quite reluctant about his career as a guard. You can learn that he only became a guard because his strong innate magic abilities meant most towns wouldn't accept him unless he worked in a \"respectable career.\"\n\nReturn to Captain Waltain with your required levels and Toblaine. Despite both his and Toblaine's reservations, the captain agrees to help and says he'll instruct Constable Carver to ignore your activities at the compound, which will advance the story to Retrieving the Golden Cog.","tables":[],"url":"https://brightershoreswiki.org/w/Getting_clearance_from_Waltain","last_modified":"2024-11-12T16:17:47Z","categories":["Category:Crenopolis","Category:Needs image","Category:Quests"]}