{"title":"Head to Stonemaw Hill","content":"\n\n\n\nThe quest Head to Stonemaw Hill is a continuation of the Main Story, commencing immediately after completing Help Rachella.\n\n\n * Completion of Help Rachella\n\n\n * Speak to Rachella in the Goose Inn Bar.\n * Travel to Rocky Road and talk to either Sentry Drogentyne or Sentry Drogentyna.\n * Head to the East Courtyard in Crenopolis and attempt to Climb the Tree.\n * Speak to Captain Waltain in Waltain's Office, which will advance the story to Getting clearance from Waltain.\n\nSpeak to Rachella in the Goose Inn Bar about her recent encounter with the sorcerers. She recounts overhearing a conversation between three sorcerers: Yeddick, Damiok, and an unnamed third sorcerer. In her recounting, she witnesses Damiok talking about being injured by a Crystal Scorpion while traveling through the Gemrift.\n\nThe sorcerers discuss several key locations for their plans:\n * Stonemaw Hill - Located northwest of Hopeport, accessed through the wasteland and up Rocky Road. Note: The dwarves controlling access are reluctant to allow humans entry.\n * Castle Gragwatch - Located on a separate island, currently inaccessible due to storms affecting all ports.\n * The Well - A specific location of significance, though its whereabouts are unknown.\n\nThe sorcerers mention placing crystals at breach points and discuss \"Vilzax spells\", which are apparently powerful but dangerous to cast in the Gemrift due to risk of awakening \"the sleeper\".\n\nAfter learning this information, head northwest through the wasteland towards Rocky Road.\n\nAt the entrance to Stonemaw Hill, you'll find Sentry Drogentyne and Sentry Drogentyna guarding the stockade. They will initially refuse entry, explaining that Stonemaw Hill is sacred dwarven ground forbidden to humans.\n\nThe sentries reveal that humans previously stole the Golden Cog from the Great Engine, which powered their machines with spiritual energy. They explain that retrieving the cog would likely grant you special dispensation to enter Stonemaw Hill.\n\nAccording to Sentry Drogentyne, the Golden Cog is now in the possession of Helfar the Nightcrow, who resides in a secure compound in the northeast of Crenopolis.\n\nHead to the East Courtyard in Crenopolis and attempt to Climb the Tree.\n\nYou'll be stopped by Helfar's guard and Constable Carver. The guard will call for Constable Carver to intervene, who reveals that Captain Waltain has an agreement to leave the compound undisturbed.\n\nSpeak to Captain Waltain in Waltain's Office, which will advance the story to Getting clearance from Waltain.\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Head_to_Stonemaw_Hill","last_modified":"2024-11-10T15:02:15Z","categories":["Category:Crenopolis","Category:Needs image","Category:Quests"]}