{"title":"Help Rachella","content":"\n\nHelp Rachella is a Main Story quest that involves sourcing various items for Rachella so that she is eligible to become a member of the Merchant's Guild, in exchange for information regarding the Red Robed Sorcerer.\n\nThe quest also allows players to become a member of the Merchants' Guild themselves, which enables them to freely trade once player to player trading is implemented into the game.\n\nAs a Main Story quest, it is an immediate continuation of Find Captain Waltain.\n\n\n * Completion of Find Captain Waltain\n * Level 8 Merchant icon.png Merchant\n * Level 10 Leatherworker icon.png Leatherworker\n * Level 16 Detective icon.png Detective\n * Ability to kill multiple Street Hags of any level\n * 2-4 free inventory spaces\n\n\n * 2 Beef Joints\n * 2 Clockwork Sheep\n * 1 Brown Cow Leather (cannot be store-bought)\n * 1 Brown Cow Hide to craft the leather\n * 2 Bottles\n * 1 Soap (easily obtainable during quest)\n\n\n * 1) Talk to Channer Goldway in the Merchant's Guild to receive a list of items to obtain\n * 2) Obtain the following items:\n * 3) * Street Hag Earrings\n * 4) *# Kill Street Hags of any level in Dawkin Lane until two drop\n * 5) * Leatherworker's Patches\n * 6) *# Needed: Level 10 Leatherworker icon.png Leatherworker, 1 Brown Cow Leather (cannot be store-bought)\n * 7) *# Speak to Jack Wellis in the Leatherworks shop with a Brown Cow Leather in your inventory\n * 8) * Bottled Water of Delight\n * 9) *# Needed: 2 Bottles, 1 Soap (obtainable during quest)\n * 10) *# In Kaynat's Garden, speak to Kaynat's Doorman and tell him you work there\n * 11) *# Travel to the Servant's House on Murkwell Lane\n * 12) *#* If needed, buy 1 soap from the nearby Soap Shop\n * 13) *# Push the pudding that is sitting on the table onto the servant's clothes\n * 14) *# Pick up the clothes from the ground in the servant's bathroom and clean them in the copper sink with the purchased soap\n * 15) *# Return to Kaynat's Garden and again, tell the doorman you work there\n * 16) *# Once through the door and into the next room, use the fountain twice for your 2 Bottled Water of Delights\n * 17) * Greenstowe Silver Candlesticks\n * 18) *# ''Needed: Level 16 Detective icon.png Detective\n * 19) *# Go to Bogg's Antiques and talk to Bogg\n * 20) *# Speak to Sergeant Scowler in the Investigation Hall\n * 21) *# Go the Guard's Archive to find the file (they are filed alphabetically)\n * 22) *# Read the file you retrieve and go to Slant Street\n * 23) *# Speak to the civilians who will eventually tell you that there is a man in Thadwick Square\n * 24) *# Speak to Hallig in Thadwick Square, who will tell you to go to Peacock Road North to find Evaldrick Peters\n * 25) *#* The house is opposite Hamila Jimore's Garden\n * 26) *# Knock on the door and speak to the character who will tell you that you cannot enter without a warrant from Captain Waltain\n * 27) *# Go to Waltain's Office and speak to him to get the warrant\n * 28) *# Go back to the locked house and break down the door\n * 29) *# Find the loot box then open it from the main quest inventory\n * 30) *# Return it to Sergeant Scowler for Detective XP\n * 31) * Beef Joints\n * 32) *# Needed: Level 6 Merchant, 2 free inventory spaces\n * 33) *# Purchase 2 from Henderson in Henderson's Meat\n * 34) * Clockwork Sheep\n * 35) *# Needed: Level 8 Merchant, 2 free inventory spaces\n * 36) *# Purchase 2 from Penny Palmer in Lord's Road East\n * 37) Deliver half of the items to Channer Goldway in the Merchant's Guild\n * 38) Deliver the remaining items to Rachella in the Goose Inn Bar\n * 39) This will then advance the Main Story to Head to Stonemaw Hill\n\nAfter talking to Rachella (concluding the Find Captain Waltain quest), she explains that she'll share the information she has regarding the Red Robed Sorcerer in exchange for you helping her obtain items to become a member of the Merchants Guild.\n\nShe tells you to obtain the Merchants Guild List from Channer Goldway in the Merchants' Guild.\n\nUpon talking to Goldway, he reveals that there are only two ways to join the Guild: either be a member of one of the great trading families, or prove yourself as an excellent merchant by completing a challenge of obtaining a list of items. The list is added to the quest inventory, and reads:\n\n''You read the list of items. It says - Leather worker's Patch, Street Hag Earring, Water of Delight, Greenstowe Silver Candlestick, Beef Joint, Clockwork Sheep. ''\n\nItems can be obtained in any order, but all must be obtained to proceed with the quest. The quest recommends fetching two of every item so that both Rachella and the player can become members of the Merchants' Guild.\n\nItems can either be delivered after obtaining them, or all at once at the end of the quest. With the exception of the Beef Joints and Clockwork Sheep, items are kept in the quest inventory and do not occupy player inventory space.\n\nOne of each item should be delivered to Channer Goldway (for the player's ability to join the Merchants' Guild), and the other of each item to Rachella to progress the quest.\n\nNote: This location is right near the Soap Shop, so you can pick some up there if needed for the Bottled Water of Delight.\n\nKilling Street Hags will offer a chance to receive an earring as a drop. A text box will appear after each kill, either showing \"No earring on this particular hag\" (meaning an unsuccessful drop), or \"Hurrah. This hag has an earring!\".\n\nContinue to kill hags until two earrings have been obtained.\n\nNeeded: Level 10 Leatherworker, 1 Brown Cow Leather (cannot be store-bought)\n\nTalk to Jack Wellis in the Leatherworks, telling him that you'd like to learn to make a leatherworker's patch. He'll tell you that they are only for accredited leatherworkers of Crenopolis.\n\nIf you are not yet a level 10 Leatherworker, he'll inform you that you have not yet trained enough. Once you're at least level 10, he'll consider you \"accredited\" and agree to show you how to make the the patches.\n\nIf at that point you don't have any basic Brown Cow Leather in your inventory, he'll ask you to fetch that first. This must be made yourself, from a Brown Cow Hide, rather than purchased from a store.\n\nWith the leather in your inventory, Wellis will then allow you to craft two patches.\n\nNeeded: 2 Bottles, 1 Soap (obtainable during quest)\n\nTalking to Channer Goldway about the item will reveal that it comes from the Spring of Delight in the north of the city. He'll inform you that today the spring resides beneath the property of Kaynat Wray, who is quite particular about who can access the water.\n\nHead to Kaynat's Garden and speak to Kaynat's Doorman. After telling him that you've come to see the Fountain of Delight, he'll push back and inform you that the seeing the fountain is by invitation only. Trying to convince him that you work there as a new servant suggests that you might be able to sneak in with the right attire.\n\nAfter telling him you're struggling to find your uniform, he'll ask if you're the new servant who works on Murkwell Lane. After agreeing, he'll suggest you look there to find it.\n\nHead to the Servant's House in Murkwell Lane. The actual servant will be sat at a table, wearing the clothes you need to acquire. Push the pudding on the table in front of him, which will cause you to \"accidentally\" spill it over him. He'll panic and rush to the bath to clean up.\n\nInside the Servant's Bathroom, pick up the Servant's Clothes from the floor, which will be added to your quest inventory. If you don't at this point have any soap, head to the Soap Shop and purchase one from Bubbles MacLeish.\n\nBack in the Servant's House, use the clothes on the Copper sink to clean them. This will use up the soap from your inventory.\n\nEquip the clothes from your quest inventory and head back to Kaynat's Garden and talk to the doorman again, telling him you work there. He'll acknowledge your clothes and unlock the door for you.\n\nHead north to the Fountain of Delight and use two bottles on the fountain. You'll need to do this two separate times. The filled bottles will be added to your quest inventory.\n\n''Needed: Level 16 Detective\n\nHead to Bogg's Antiques and talk to him about Greenstowe Silver Candlesticks. He'll tell you that he used to have them, but they were stolen a couple of months ago. After telling him you work for the city guard, he'll tell you that he's already reported the crime and Sergeant Scowler is in charge of the investigation, but hasn't heard much information other than that.\n\nHead to the Investigation Hall and speak with Sergeant Scowler. After asking him about Bogg's case, he'll tell you that he's been putting it off because of higher priority cases. You'll ask if you can take a look into it, and he'll agree by suggesting you take a look at his case in the Guard's Archive room.\n\nSearch the A-Cla files inside the Archive room to find Bogg's File, it will be put into your quest inventory. Reading the file says:\n\n''Residents saw a man entering Slant Street around the time of the crime. He smelt of greasy meat. He had a top tied ponytail, and an anchor beard.''\n\nOptionally, visit Slant Street and talk to the civilians who will eventually tell you that there is a man in Thadwick Square.\n\nHead to Thadwick Square and question Hallig about his reason for being on Slant Street during the time of the crime. He'll explain that he was fetching supplies for his stall, and provides a credible alibi. He'll inform you that he saw Evaldrick Peters, a servant for Fillan, leaving the antique store with a large sack. He tells you that Fillan lives on Peacock Road North.\n\nHead to Peacock Road North and attempt to Knock on the north-west door. A worried voice will answer, exclaiming that he demands you have a warrant from Captain Waltain before you can enter the property.\n\nVisit the Captain in Waltain's Office, telling him that you need a warrant to enter Fillan's house. Waltain is initially skeptical, explaining that Fillan is a rich man, though is easily persuaded after you explain that his servant had stolen the candlesticks.\n\nWith the warrant in your quest inventory, head back to Fillan's house and Break Down the door. Head north to Fillan's Storeroom and pick up the Loot Box. Searching the box (which is now in your quest inventory) will provide the two candlesticks, and tell you that it should be taken back to Sergeant Scowler.\n\nReturn to the Investigation Hall and give the box to Scowler who will praise your good work and award you with Detective experience.\n\nNeeded: Level 6 Merchant, 2 free inventory spaces\n\nA Beef Joint can be purchased from Henderson in Henderson's Meat at Merchant level 6.\n\nThis item does not go into the quest inventory, so two free slots will be needed if purchasing both at the same time.\n\nNeeded: Level 8 Merchant, 2 free inventory spaces\n\nA Clockwork Sheep can be purchased from Penny Palmer in Lord's Road East at Merchant level 8.\n\nThis item does not go into the quest inventory, so two free slots will be needed if purchasing both at the same time.\n\nOnce all items have been gathered, take the first half to Channer Goldway in the Merchant's Guild. Once the items have been given, he'll congratulate you on becoming a Guild member and grant you access to player to player trading.\n\nWith the remaining half of the items, return to Rachella in the Goose Inn Bar and give her all of the items.\n\nThis will then advance the Main Story to Head to Stonemaw Hill.","tables":[],"url":"https://brightershoreswiki.org/w/Help_Rachella","last_modified":"2024-11-12T22:49:18Z","categories":["Category:Crenopolis","Category:Needs image","Category:Quests"]}