{"title":"Immunity","content":"Immunity is a spell granted just before completing the instanced Debrief portion of the Main Story by Ingrina Pelegrin. This spell has no cooldown and takes six seconds to cast.\n\nImmunity can be use in or out of combat, but is primarily used during combat to allow the player to end the combat early, acting as a run away or flee mechanic.\n\nIn order to cast Immunity in combat, the player may either click the spell in the spellbook or click the red icon located in the center of the combat bar just below the player's level. There is currently no interrupt mechanic, so assuming the attacker cannot lower the player's health to 0 before the 6 second cast time is completed, the player will exit combat immediately and remain immune as long as the player remains stationary and does not perform any additional actions.\n\nWhen cast outside of combat, the player becomes immune to attack and remains immune as long as the player remains stationary and does not perform any additional actions.\n\nUpon moving or performing an action, the spell is active for 30 seconds or until the player passes through a doorway to an adjacent area. If the player engages in another combat, the spell effect is cancelled.\n\nThe Immunity buff persists through logging out and logging back in. Upon logging back in, the immunity spell is active indefinitely if the player remains stationary and performs no actions. However, when the player moves following logging back in, the spell is only active for approximately 3 seconds instead of the standard 30 seconds.\n\nIf the player logs out after the spell has already begun it's 30 second timer, it will be reset to the indefinite timer upon logging in and remain indefinite until performing an action, which triggers the post-log in 3 second timer.\n\nPlayers can cast immunity when already immune, but doing so counts as an action and begins the 30 second timer.\n\nImmunity is cast if the player remains trying to pass through a doorway while in combat, even if the player does not manually cast the spell.\n\n\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Immunity","last_modified":"2024-11-13T00:23:46Z","categories":["Category:Pages with update history","Category:Spells"]}