{"title":"Interface","content":"The interface is the display of the icons, windows, and other elements on the Brighter Shores game window.\n\nPlayers primarily interact with the interface by pointing and clicking with their mouse. There are also keyboard keybinds to perform some actions that can be set up in the controls interface. Various interface components also feature inputting information with keyboard through various prompts.\n\nMany sub-interfaces such as the agreement, canceling purchase, chat agreement, children's privacy notice, controls, delete, delete character, game rules, game rules violations, news, Premium Pass, privacy notice, privacy settings, restore purchases, settings, terms and conditions, and third party licenses interfaces open as modal windows, dimming the interface in the background. The modal interfaces can be closed with the red \"X\" button in their top right corner. Some sub-interfaces such as the delete character interface also have an arrow button in their top left corner, enabling the users to navigate back to the previous interface.\n\nWhen logged in without playing with a player character, failing to produce any input to the interface for a minute causes a forced logout back to the title screen due to inactivity. When playing with a player character, a warning about this occurs after four minutes of inactivity, after which there is a minute to produce input before the logout occurs. Moving the mouse cursor counts as input.\n\nThe main interface of the game consists of a game window with camera focused on the player character. Players interact with the game world by clicking with their mouse. There is an overlay showing the room name on the top, and buttons to open various sub-interfaces in the corners.\n\nOn the left and right, there are arrow buttons to open and close the side interfaces which can be used to have one of the sub-interfaces any of the corners open at all times. The proportion that the sub-interface takes from the side interface can be adjusted by dragging the divider up or down.\n\nThe locations of the sub-interface buttons can be customized by dragging them between the slots. There are four slots in each corner. Dragging a button to a slot with another button present swaps their positions.\n\nNon-player characters that the player needs to talk to in order to progress quests feature a speech bubble with three dots in it and always have their name displayed above them. Items on ground always show their rarity and name above them. Hovering over non-player characters or interactable scenery also displays the object's name. Clicking on an interactable entity opens an action menu listing the options that the player has to interact with the entity.\n\nFor further information on how to interact with the interface, see controls.\n\n\n * Backpack\n * Emote\n * Map\n * Settings\n * Toolbelt\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Interface","last_modified":"2024-11-13T11:04:28Z","categories":["Category:Interface","Category:Mechanics"]}