{"title":"Nullify the corruption","content":"\n\n\n\n\n * Save the Dryad in Dryad Glade.\n * Talk to the Dryad and follow the North Central Path in the direction Jermais went.\n * Look for orange irises in Thin Trail, North from the Dryad Glade and use the Dryad Leaf.\n\n\n * In the Magic Cave, choose one of the three Factions: Guardian, Cryoknight or Hammermage. (This is a permanent choice)\n\n\n * Find the source of corruption in the Northeast past the Overgrown Trail.\n * Fight Jermais (level 12), who has been corrupted.\n * Follow the Dryad and gather 2 Glowing Beetles\n * Use the beetles on the Giant Crystal in Crystal Clearing.\n\n\n * The crystal still contains corruption and requires more items.\n * Listen to the Dryad hints about more magic sources around Hopeforest.\n\n\n * Collect Glowing Mushroom at the Mushroom Grove near Crystal Clearing. Requires level 8 Woodcutter to clear Brambles.\n\n\n * Find a Glowing Bee Hive at the Two Headed Bear Clearing, which is being guarded by a level 20 Giant Two Headed Bear.\n * Taking from the Glowing Bee Hive requires a Jar.\n * The boss can easily be killed by staying at the bridge and waiting for the slam attack, then attacking while it charges before stepping back. You can also stand on the far edge of the bridge to regain health if low, out of the bear's range.\n\n\n * Fix the ferry at Hopeforest Ferry. Requires 4 Coarse Ash Planks.\n * Fight the Mutant Newt by avoiding the leap attacks. Make sure to repair the ferry between leaps.\n\n\n * Once the fight is over pick the Glowing Fern on the other side of the river.\n * With the Glowing Mushroom, Glowing Honey and Glowing Fern, go back to Crystal Clearing and use the items on the crystal to summon the Dryad.\n\n\n * The Dryad mentions that there is more corruption emanating from a mine to the southeast of the forest.\n * Head to Barricades and chat with the Barricade Guard.\n\n\n * Talking to the Barricade Guard starts the Get clearance from Jal quest.\n\n\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Nullify_the_corruption","last_modified":"2024-11-13T04:46:48Z","categories":["Category:Hopeforest","Category:Needs image","Category:Pages with update history","Category:Quests"]}