{"title":"Retrieving the Golden Cog","content":"\n\n\n\nThe quest Retrieving the Golden Cog is a continuation of the Main Story, commencing immediately after completing Getting clearance from Waltain.\n\n\n * Completion of Getting clearance from Waltain\n * Ability to defeat a level 20 Helfar's Guard\n\n\n * Proceed to the East Courtyard in northeast Crenopolis.\n * Climb the tree.\n * Climb the tree again after the guard leaves.\n * Head west into Helfar's Wall.\n * Hide behind the bush until the cutscene ends.\n * Open Helfar's Side Gate.\n * Head north into Helfar's Gate, then east into Helfar's Hallway.\n * Go north into the Artifact Room.\n * Defeat one Helfar's Guard (level 20).\n * Talk to Toblaine and suggest heading back to advance the story to Return to Drogentyne.\n\nProceed to the East Courtyard in northeast Crenopolis. You'll find Constable Carver and Toblaine there. Talking to Carver confirms that he has received orders from Captain Waltain to assist with the mission.\n\nEither talk to Constable Carver or attempt to Climb the tree to have Constable Carver distract the guard, Borash. When the guard leaves, Climb the tree again to get over the wall into the compound.\n\nTo infiltrate the compound:\n * 1) Head west into Helfar's Wall\n * 2) DO NOT try to open the side gate directly - Borash will catch you and throw you out\n * 3) Hide behind the bush to trigger a short cutscene where Borash leaves his post\n * 4) Once Borash leaves, Open Helfar's Side Gate\n * 5) Head north into Helfar's Gate, then east into Helfar's Hallway\n\nThere are two doors in the hallway - the Artifact Room to the north and the Strategy Room to the east. While the Artifact Room is the correct path for progression, players can optionally enter the Strategy Room to view a humorous cutscene with Helfar.\n\nEnter the Artifact Room (north) to find the cog. A cutscene will trigger where guards interrupt the retrieval. Toblaine offers to grab the cog while you fight.\n\nCombat: Defeat one Helfar's Guard (level 20).\n\n\n\nAfter the combat, a cutscene plays showing Toblaine attempting to grab the cog. He is caught on fire and transforms into \"Possibly Toblaine\" - a blue, dragon-like form. The remaining guards flee upon seeing the transformation. Through dialogue, Toblaine reveals this transformation has happened three times before when exposed to fire, and requests discretion about his condition.\n\nTalk to Toblaine and suggest heading back to advance the story to Return to Drogentyne.\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Retrieving_the_Golden_Cog","last_modified":"2024-11-12T19:53:31Z","categories":["Category:Crenopolis","Category:Needs image","Category:Quests"]}