{"title":"Spider's Nest","content":"\n\n\n\nThe quest Spider's Nest can be started by speaking to Toblaine at the Cliffside Path.\n\n\n * 32 Carpenter\n * 20 Woodcutter\n * Tree Loppers (Not required for Storage Rift (Spell))\n\n\n * The scout level to fight off two level 35 Baby Titan Spider\n * Note: not required for access to the Storage Rift Spell or the Rainbow Water\n\n\n * I can start this quest by talking to Toblaine at the Cliffside Path.\n * Walk up to the spider and try to balance across infront of the spider\n * After the spider throws you off the cliff, Alannor will tell you that you need Tar Rats to distract the spider\n * Walk up to the spider and try to balance across infront of the spider\n * After the spider throws you off the cliff, Alannor will tell you that you need Tar Rats to distract the spider\n\n\n * Hamish Truefire (found at the Small Clearing, east of the Timberwell Green) will give me a tar rat if I can make him two anti acid shields. I will need the following items:\n * A Golden Marrow - There is a Golden Marrow in Mr McGrish's Garden.\n * Talk to Mr McGrish in Mr McGrish's Garden. Mr McGrish might let me in if I can show a Vegetable Judge Badge\n * Talk to Kedwick Shalstanger in Huntsman's Clearing.\n * Are you on the fruit and vegetable committee?\n * Can I borrow your committee badge?\n * I could demonstrate my hunting prowess\n * Run northeast to Treeway Junction and kill a Spriggan for a Spriggan Claw.\n * Return back to Kedwick Shalstanger and he will give you his Vegetable Judge Badge\n * Take the Gold Paint on Timberwell Side Road.\n * The replacement marrow is in Timberwell Green directly to the north in a garden patch.\n * Use the Gold Paint on the replacement marrow to create a Painted Marrow.\n * With the Painted Marrow and Vegetable Judge Badge, go to Mr. McGrish's Garden.\n * Replace the real golden marrow with the replacement marrow\n * A Snake Eyeball - This can be obtained by killing a Common Viper at Snakes Clearing or Snakes Path\n * 2 Uncoated Anti-Acid Shields - I need to be at least a level 32 Carpenter (Not Boostable with Boost Level Potions) to make the shields\n * To make 2 uncoated Anti-Acid-Shields you will need 2 Rugged Ash tree planks\n * Use the planks on the workbench in the carpenters workshop\n * Back at Hamish Truefire's fireplace in the Small Clearing use the snake eyeball and the golden marrow on his cauldron\n * Then use the uncoated acid-shields on his cauldron to make Coated Anti-Acid Shields\n * Talk to Hamish again and follow him south\n * Marcus Mint will appear in the cutscene and introduce you to the strange stones. You will learn the storage rift spell\n * Talk to Hamish and he will allow you to take one of his tar rats from the fireplace\n * Head back to the spider and talk to Alannor\n * On the west side of the room, you can find a big flat boulder. Place your tar rat there.\n * The spider will be lured to the boulder. Use your tree loppers on the sticky vines right next to the boulder to trap the spider\n * Now you can balance across\n * Two spiderlings (lvl 35) will hatch and attack you\n\n\n * Storage Rift Spell (Storage Rift (Spell))\n * Access to Rainbow Water\n * 26900 Carpenter Experience\n * 28500 Scout Experience\n * Brighter Shores 3WtV6dlFut.png\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Spider%27s_Nest","last_modified":"2024-11-13T09:09:26Z","categories":["Category:Needs image","Category:Pages with update history","Category:Quests","Category:Stubs"]}