{"title":"Spirit Essence","content":"\n\n\n\nStart by speaking to Captain Waltain\n\n\n * Level 31 Detective\n\n\n * The Watchperson level to defeat a level 33 mage\n\nROUGH DRAFT - EDIT TO PROPER FORMAT\n\nGo to Hamila Jimore's Hallway and speak with Hamila about the Candelabra\n\n- She gives no information\n\nHead south to The Frog and Barnacle and speak with the bartender about the Mirror.\n\nHead to Lani's Curiosities\n\nAsk about the Candelabra and the Mirror\n\n- Investigate the Door\n\n- Investigate the Spill on the ground\n\nSpeak with Lani again and ask about the Damaged Door.\n\nLani says the gate to Vestere Hall is locked and gives METAL SOFTENING CREAM\n\nHead north toward Kaynat's Garden area where Fountain of delight is\n\n-Vestere Drive is North above Hamila Jimore's Garden\n\n--Use the Meta Cream on the Iron Gate\n\n---Bend the Gate bars and Squeeze through\n\nInside the Vestere Hall Dining Room loot the Debris, Smashed Table, and the Hole to the north for 5 Puzzle pieces for the wall puzzle in the Vestere Hall Entrance. - Go back to Entrance and interact with the Wall Puzzle\n\n-- You can try and figure out the puzzle on your own, or look at the pictured finished Puzzle.\n\nGo inside the Vestere Hall Strongroom the puzzle unlocks\n\n- Take the Portrait on the wall, and the journal next to it on the shelf.\n\n-- Read Nermals Journal to find out that 8 items contain essences of an Evil Spirit.\n\nHead to Captain Waltain to trigger a cutscene about a man losing his book.\n\n- Waltain has Antlers in the evidence room in a Strongbox and asks you to put the Portrait in a Strongbox as well, the one on the far right code is 1007\n\n-- Interact with the Safe - Code is 1007 - Place Portrait, and Close Safe.\n\n--- Go back and speak with Captain Waltain who directs you to the Merchants Guild.\n\nHead to the Merchants guild and Speak with Baldwin Vranc to find out Captain Waltain has the paperweight. The Chandelier is in the Vandere house but is missing, and the Metal grate was sold to the council office.\n\nHead to the Council office just outside to the north and east of Merchants Guild.\n\n- Speak to Crenopolis Planning Officer about the Metal Grate and find out she requires a Form 391d before telling you what happened to the grate.\n\nHead back to Captain Waltain and get the Form 391d\n\nBack to the Council Office and speak with the Crenopolis Planning Officer again using the Form 391 on her.\n\n-She will hand you a sewer key to access the Northeast Sewers location.\n\n--Head back down the main road (lords Road) to Lords Road West and go North following the path to Murkwell Court. Head east and North on Murkwell Lane into the Sewers.\n\nOnce in the Sewers Entrance, head east and north being careful of aggressive monsters and retreating if necessary and use the Sewer Key on the Metal Gate.\n\nWalkthrough north for a Cutscene of Firrick the Mage speaking to a Glowing Mirror\n\n- The Mirror is mad at Firrick and senses someone else in the room causing Firrick to run and engage in a fight with you. Firrick is Level 33 so bring Potions.\n\nFIRRICK has two special attacks (tiles will glow) simply move out of the way and move back in when needed, fill up on potions and finish him off.\n\n- Once he is dead, take the items it allows you to take, including the Chandalier and leave the other two items (mirror and air vent) for Waltains men to come and pick up.\n\nReturn the items you from the Sewer area after the fight back to Captain Waltain in his Office.\n\n- 77,000 Detective XP\n\n- 34,300 Watchmen XP\n\n\n\n","tables":[],"url":"https://brightershoreswiki.org/w/Spirit_Essence","last_modified":"2024-11-10T08:12:38Z","categories":["Category:Needs image","Category:Pages with update history","Category:Quests"]}