{"title":"The Brannof Inheritance","content":"\n\n\n\nThe quest The Brannof Inheritance can be started by speaking to Hayley Brannof at the Scrapyard.\n\n\n * 50 Alchemist\n * 61 Chef\n\n\n * I can start this quest by talking to Hayley Brannof at the Scrapyard.\n * Collect a Paper and a Quill and Ink from Brannof's Chamber and add them to your toolbelt.\n\nI'm collecting clues for Hayley Brannof to find a lost inheritance:\n * I need to decipher the Swirl Clue:\n * The Geometric Shapes referenced in the clue can be found in Rocky Road.\n * Travel to Sea Road and investigate the Swirl Symbol on the wall of the building near the path to the scrapyard.\n * Use a Quill and Ink on the Map of Hopeport quest item to mark the spot on your map.\n * Use a Quill and Ink on the Map of Hopeport quest item to mark the spot on your map.\n\n\n * I need a clue from James Newtap:\n * James Newtap in Pipe Alley wants a me to make a potion to cure hair loss. You need at least 50 Alchemist\n * Speak to Ebsworth the Hopeport Apothecary about making a hair loss cure potion.\n * Go to the Scrapyard and use the Red Cheese on the bathtub before removing the broom and retrieving the rat.\n * Go to Rubble Road and kill a hair beast to retrieve the hair beast hair.\n * Finally return to Ebsworth, who will tell you to make the potion.\n\n\n * I need a clue from the Hadley Family:\n * Oswald Hadley in The Delectable Dab Restaurant wants a Bigeye Gurnard Soup:\n * I need to be at least a level 61 Chef to make a Gurnard Soup.\n\n\n * I need a clue from Lord Brannof\n * Lord Brannof will give you a Falcon Clue\n * The corresponding Falcon Symbol is located in Wasteland.\n * Investigate the Falcon Symbol in the ruins and use the Quill and Ink on your quest item map to mark the location.\n\nAfter locating the symbols, to mark the locations on the map, you need to have a Quill and Ink on your tool belt (one can be found on the desk in Lord Brannof's room or in Captain Degreene's Office). Then use it with the map.\n\n326 Silver\n\n21,300 Alchemist EXP\n\n26,300 Chef EXP\n\n31,300 Guard EXP\n\n","tables":[],"url":"https://brightershoreswiki.org/w/The_Brannof_Inheritance","last_modified":"2024-11-09T19:52:47Z","categories":["Category:Hopeport","Category:Needs image","Category:Pages with update history","Category:Quests","Category:Stubs"]}