{"title":"The Lost Shipment","content":"\n\n\n\nThe quest The Lost Shipment can be started by speaking to Cohen in Brannof's Dining Room.\n\n\n * 25 Fisher to catch a Fetid Flounder.\n * US$8280\n\n\n * Ability to defeat a level 30 thief and level 30 furtive stranger.\n\n\n * I can start this quest by talking to Cohen in Brannof's Dining Room.\n\n\n * Speak to Captain Shirker on the Vincible, ensure you're not wearing any guard armour.\n * Speak to Captain Shirker at The Delectable Dab Restaurant.\n * Speak to the Man in a Waistcoat at the Town Square.\n * Speak to the Hairdresser and ask him to give you a Monobrow, he will ask for US$8280 as payment.\n\n\n * Chat with Nelson or Wellington in The Hooked Hand (make sure to remove your armour first).\n * Get the Paper and Pen from the desk in Brannof's Chamber.\n * Use the Paper with the Pen and write the Weapons Order. You can do so by accessing your Toolbelt and then using the Pen on the Paper.\n * Catch the Fetid Flounder in the Overgrown Pond.\n * Use the Weapons Order on the Fetid Flounder to make the Fetid Flounder with a note in it.\n * Give the Fetid Flounder with a note in it to the fishmonger on Eel Street.\n * Lurk behind the bush near the fishmongers cart.\n * Follow the suspicious man through Wilhope Crossing, Wilhope Passage and Monob Row.\n * Knock on the door with your helmet unequipped and impersonate Monobrow Sam.\n * Prepare for a fight with a level 30 thief and level 30 furtive stranger and enter the Thieves Den.\n * If you retreat from the fight area or die, taking a fear potion before returning will stop the thief from attacking you upon reentering the area.\n * If you kill the thief and die after, the thief will stay dead, allowing you to fight the furtive stranger.\n * The furtive stranger can be difficult at low levels, try using a range weapon to get a few hits in before he reaches you, then be sure to have potions to heal during the fight.\n * Kiting the thief and furtive stranger around the central box in the room can help to delay their attacks, allowing you to take more health potions during a fight and/or regen more health over time.\n\n\n * Collect your reward from the Crate.\n\n\n * Rare Carthian Plumbatae.\n * 15,600 Fisher XP.\n * 17,200 Guard XP.\n\n\n\n","tables":[],"url":"https://brightershoreswiki.org/w/The_Lost_Shipment","last_modified":"2024-11-13T06:55:37Z","categories":["Category:Needs image","Category:Pages with update history","Category:Quests","Category:Stubs"]}