{"title":"The Battle of Fortunehold","content":"\n\n\n\nThe quest The Battle of Fortunehold can be started by speaking to Porletta at Fortunehold.\n\n\n * 50 Leatherworker\n * 55 Merchant\n * Quill and Ink\n * US$336000\n\n\n * Ability to fight a level 60 boss\n\n\n\n\n * Go to Fortunehold and talk to Porletta.\n\n\n * Go to Hamila Jimore's Hallway and talk to Hamila Jimore.\n * (Maybe possible to skip this step by forging the notepaper in the quest inventory?)(Can soneone test this out?)\n\n\n * Open quest Inventory and use Hamila's Headed Notepaper on Quill and Ink.\n * You can get Quill and ink from Captain Jal Degreene's Office table\n\n\n * Go to Helfar's Gate and put the forged note in the mailbox by the gate.\n * Enter Helfar's Strategy Room (Requires progress in main story to enter)\n * Analyze the Invasion plans\n\n\n * Report back to Porletta in Fortunehold, she will provide 2 Objectives that you can do separately.\n * Objective 1 starts with  I overheard some of his plans \n * Objective 2 starts with We need to figure out how to defend the side gate \n\n\n * Go to Unicorn Farm and talk to Thomas Cyclops\n * Go to Fortunehold Meaddow and talk to Thomas Cyclops, Thomas asked me to gather items for the fete.\n * Bunting.\n * Talk to Porletta in Fortunehold\n * Green Olives.\n * Requires 32 Merchant (With 3 knowledge in afk, or 1 with +2 boost) ; you can also purchase Olives directly at the merchant if you have 92+ Alchemy\n * You need 8 full bottles of Olives, Use them on the olive barrels infront of Thomas Cyclops.\n * Throwing Cushions.\n * Requires 50 Leatherworking and one Moderate Bison Hide, Talk to Jack Wellis at the Leatherworks\n * A Flugelhorn Player.\n * Go to Unicorn Farm and talk to Walter Cyclops\n * Then move to Shrubby Canyon and search the grass\n * Return to Walter and use the horn on him\n * Go to Lani's Curiosities, Talk to Lani he'll sell you the polish for US$84000\n * Return to Walter at Unicorn Farm\n\n\n * Go to Meggrit's Market and Jump over the broken Gate.\n * Requires 55 Merchant and US$252000 to progress further\n\n\n\n\n * 124,000 Watchman experience\n * 35,500 Leatherworker experience\n * 39,100 Merchant experience\n * A shortcut between Meggrit's Market and Fortunehold Farm","tables":[],"url":"https://brightershoreswiki.org/w/The_Battle_of_Fortunehold","last_modified":"2024-11-12T16:46:50Z","categories":["Category:Needs image","Category:Quests"]}